# k-ближайших соседей
# Алгоритм подходит для классификаций
# При вычислениях данным алгоритмом нужно выделить два ключевых свойства по которым будет проводиться сравнение.
# Расстояние между двумя сравниваемыми объектами вычисляется по формуле Пифагора:
#   math.sqrt((x1 - x2)**2 + (y1 - y2)**2)
# Данная формула может быть адаптирована под необходимое количество характеристик
# У k-ближайших соседей есть два основных применения: классификация и регрессия.
# Классификация - распределение по категориям.
# Регрессия - прогнозирование ответа
# .